
# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  - [-1, 1, MutilScaleEdgeInfoGenetator, [[64, 128, 256]]] # 4
  - [4, 1, GetIndexOutput, [0]] # 5-P3/8
  - [4, 1, GetIndexOutput, [1]] # 6-P4/16
  - [4, 1, GetIndexOutput, [2]] # 7-P5/32

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [3, 1, Blocks, [64, BasicBlock_DBConv, 2, 2, 'relu']] # 8
  - [-1, 1, Blocks, [128, BasicBlock_DBConv, 2, 3, 'relu']] # 9-P3/8
  - [-1, 1, Blocks, [256, BasicBlock_DBConv, 2, 4, 'relu']] # 11-P4/16 -10
  - [-1, 1, Blocks, [512, BasicBlock_DBConv, 2, 5, 'relu']] # 13-P5/32 -11

head:
  - [-1, 1, GSConv, [256, 1, 1, None, 1, 1, False]]  # 15 input_proj.2 -12
  - [-1, 1, AIFI, [1024, 8]] # 16 -13
  - [-1, 1, GSConv, [256, 1, 1]]  # 17, Y5, lateral_convs.0 -14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18 -15
  - [10, 1, GSConv, [256, 1, 1, None, 1, 1, False]]  # 19 input_proj.1 -16
  - [[-2, -1], 1, Concat, [1]] # 20 -17
  - [-1, 3, VoVGSCSP, [256]]
  - [-1, 1, GSConv, [256, 1, 1]]   # 22, Y4, lateral_convs.1 -19

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 23 -20
  - [9, 1, GSConv, [256, 1, 1, None, 1, 1, False]]  # 24 input_proj.0 -21
  - [[-2, -1], 1, Concat, [1]]  # 25 cat backbone P4 -22
  - [-1, 3, VoVGSCSP, [256]]
  - [[5, -1], 1, ConvEdgeFusion, [256]] # 27-P3/8 -24

  - [-1, 1, GSConv, [256, 3, 2]]   # 28, downsample_convs.0 -25
  - [[-1, 19], 1, Concat, [1]]  # 29 cat Y4 -26
  - [-1, 3, VoVGSCSP, [256]]
  - [[6, -1], 1, ConvEdgeFusion, [256]] # 31-P4/16 -28

  - [-1, 1, GSConv, [256, 3,2]]   # 32, downsample_convs.1 -29
  - [[-1, 14], 1, Concat, [1]]  # 33 cat Y5 -30
  - [-1, 3, VoVGSCSP, [256]]
  - [[7, -1], 1, ConvEdgeFusion, [256]] # 35-P5/32 -32



  - [[24, 28, 32], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
